historic/perfv1/buffered/m2.x4large_piops143_3000/randread-09-4m.fio.out
randread-4m: (g=0): rw=randread, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=10
fio-2.1.4
Starting 1 process

randread-4m: (groupid=0, jobs=1): err= 0: pid=27898: Sat Mar 15 11:18:54 2014
  read : io=3852.0MB, bw=65715KB/s, iops=16, runt= 60024msec
    slat (msec): min=8, max=72, avg=61.85, stdev= 6.67
    clat (usec): min=6, max=574589, avg=550622.63, stdev=71545.32
     lat (msec): min=62, max=637, avg=612.47, stdev=73.39
    clat percentiles (msec):
     |  1.00th=[  127],  5.00th=[  545], 10.00th=[  562], 20.00th=[  562],
     | 30.00th=[  562], 40.00th=[  562], 50.00th=[  562], 60.00th=[  562],
     | 70.00th=[  562], 80.00th=[  562], 90.00th=[  562], 95.00th=[  570],
     | 99.00th=[  570], 99.50th=[  570], 99.90th=[  578], 99.95th=[  578],
     | 99.99th=[  578]
    bw (KB  /s): min= 6532, max=65536, per=96.90%, avg=63679.62, stdev=9494.32
    lat (usec) : 10=0.42%
    lat (msec) : 100=0.42%, 250=1.14%, 500=2.39%, 750=95.64%
  cpu          : usr=0.03%, sys=5.63%, ctx=55918, majf=0, minf=10267
  IO depths    : 1=0.4%, 2=0.8%, 4=1.7%, 8=97.1%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.6%, 8=0.0%, 16=0.4%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=963/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=3852.0MB, aggrb=65714KB/s, minb=65714KB/s, maxb=65714KB/s, mint=60024msec, maxt=60024msec

Disk stats (read/write):
  xvdg: ios=90300/0, merge=0/0, ticks=2804644/0, in_queue=2806022, util=98.63%